[Назад, к списку домашних заданий](../README.md)
# Домашнее задание №3. Построение Underlay сети(ISIS).
## 1. План работ.
1. Скопировать стенд с домашнего задания №1.
2. Настроить ISIS на spine и leaf коммутаторах
3. Убедиться в наличии связности между коммутаторами, с фиксацией результатов.
4. Сохранить конфигурацию сетевого оборудования.

## 2. Схема топологии CLOS.
![Мое фото](../L1.png)

## 3. Адресное пространство для Underlay.
### Таблица 1. Адресное пространство.
|Адресация|Назначение|
|--------|--------|
|10.0.1.**\<SN\>**/32|loopback интерфейсы для spine, где SN = 1-255|
|10.1.1.**\<LN\>**/32|loopback интерфейсы для leaf, где LN = 1-255|
|10.2.**\<SN\>**.**\<N\>**/30|p2p линки между spine и leaf, где SN = номер spine, N = 0-255|
|10.0.4.0/16|Overlay|
### Таблица 2. Сетевые адреса интерфейсов.
|Оборудование|Интерфейс|Адрес|
|--------|--------|----------|
|spine1|loopback1|10.0.1.1/32|
|spine2|loopback1|10.0.1.2/32|
|leaf1|loopback1|10.1.1.1/32|
|leaf2|loopback1|10.1.1.2/32|
|leaf3|loopback1|10.1.1.3/32|
|spine1|Eth1|10.2.1.0/31|
|leaf1|Eth1|10.2.1.1/31|
|spine1|Eth2|10.2.1.2/31|
|leaf2|Eth1|10.2.1.3/31|
|spine1|Eth3|10.2.1.4/31|
|leaf3|Eth1|10.2.1.5/31|
|spine2|Eth1|10.2.2.0/31|
|leaf1|Eth2|10.2.2.1/31|
|spine2|Eth2|10.2.2.2/31|
|leaf2|Eth2|10.2.2.3/31|
|spine2|Eth3|10.2.2.4/31|
|leaf3|Eth2|10.2.2.5/31|
|pc1|Eth1|10.4.0.11/16|
|pc2|Eth1|10.4.0.12/16|
|pc3|Eth1|10.4.0.13/16|
|pc4|Eth1|10.4.0.14/16|
## 4. Настройки сетевого оборудования.
<details>
  <summary>spine1 configuration</summary>

  ```cisco
spine1#sh run
! Command: show running-config
! device: spine1 (vEOS-lab, EOS-4.27.0F)
!
! boot system flash:/vEOS-lab.swi
!
no aaa root
!
transceiver qsfp default-mode 4x10G
!
service routing protocols model ribd
!
hostname spine1
!
spanning-tree mode mstp
!
interface Ethernet1
   description leaf1
   no switchport
   ip address 10.2.1.0/31
   isis enable spine1
   isis network point-to-point
!
interface Ethernet2
   description leaf2
   no switchport
   ip address 10.2.1.2/31
   isis enable spine1
   isis network point-to-point
!
interface Ethernet3
   description leaf3
   no switchport
   ip address 10.2.1.4/31
   isis enable spine1
   isis network point-to-point
!
interface Loopback1
   ip address 10.0.1.1/32
   isis enable spine1
   isis passive
!
interface Management1
!
ip routing
!
ip prefix-list connected
   seq 10 permit 10.0.0.0/14
   seq 20 deny 0.0.0.0/0
!
route-map connected permit 10
   match ip address prefix-list connected
!
route-map connected deny 20
   match ip address prefix-list connected
!
router isis spine1
   net 49.0001.0100.0000.1001.00
   is-hostname spine1
   is-type level-2
   log-adjacency-changes
   redistribute connected route-map connected
   !
   address-family ipv4 unicast
!
end
spine1#
  ```
</details>

<details>
  <summary>spine2 configuration</summary>

  ```cisco
spine2#sh run
! Command: show running-config
! device: spine2 (vEOS-lab, EOS-4.27.0F)
!
! boot system flash:/vEOS-lab.swi
!
no aaa root
!
transceiver qsfp default-mode 4x10G
!
service routing protocols model ribd
!
hostname spine2
!
spanning-tree mode mstp
!
interface Ethernet1
   description leaf1
   no switchport
   ip address 10.2.2.0/31
   isis enable spine2
   isis network point-to-point
!
interface Ethernet2
   description leaf2
   no switchport
   ip address 10.2.2.2/31
   isis enable spine2
   isis network point-to-point
!
interface Ethernet3
   description leaf3
   no switchport
   ip address 10.2.2.4/31
   isis enable spine2
   isis network point-to-point
!
interface Loopback1
   ip address 10.0.1.2/32
   isis enable spine2
   isis passive
!
interface Management1
!
ip routing
!
ip prefix-list connected
   seq 10 permit 10.0.0.0/14
   seq 20 deny 0.0.0.0/0
!
route-map connected permit 10
   match ip address prefix-list connected
!
route-map connected deny 20
   match ip address prefix-list connected
!
router isis spine2
   net 49.0001.0100.0000.1002.00
   is-hostname spine2
   is-type level-2
   log-adjacency-changes
   redistribute connected route-map connected
   !
   address-family ipv4 unicast
!
end
spine2#
  ```
</details>

<details>
  <summary>leaf1 configuration</summary>

  ```cisco
leaf1#sh run
! Command: show running-config
! device: leaf1 (vEOS-lab, EOS-4.27.0F)
!
! boot system flash:/vEOS-lab.swi
!
no aaa root
!
transceiver qsfp default-mode 4x10G
!
service routing protocols model ribd
!
hostname leaf1
!
spanning-tree mode mstp
!
interface Ethernet1
   description spine1
   no switchport
   ip address 10.2.1.1/31
   isis enable leaf1
   isis network point-to-point
!
interface Ethernet2
   description spine2
   no switchport
   ip address 10.2.2.1/31
   isis enable leaf1
   isis network point-to-point
!
interface Ethernet3
!
interface Loopback1
   ip address 10.1.1.1/32
   isis enable leaf1
   isis passive
!
interface Management1
!
ip routing
!
ip prefix-list connected
   seq 10 permit 10.0.0.0/14
   seq 20 deny 0.0.0.0/0
!
route-map connected permit 10
   match ip address prefix-list connected
!
route-map connected deny 20
   match ip address prefix-list connected
!
router isis leaf1
   net 49.0001.0100.0100.1001.00
   is-hostname leaf1
   is-type level-2
   log-adjacency-changes
   redistribute connected route-map connected
   !
   address-family ipv4 unicast
!
end
leaf1#
  ```
</details>

<details>
  <summary>leaf2 configuration</summary>

  ```cisco
leaf2#sh run
! Command: show running-config
! device: leaf2 (vEOS-lab, EOS-4.27.0F)
!
! boot system flash:/vEOS-lab.swi
!
no aaa root
!
transceiver qsfp default-mode 4x10G
!
service routing protocols model ribd
!
hostname leaf2
!
spanning-tree mode mstp
!
interface Ethernet1
   description spine1
   no switchport
   ip address 10.2.1.3/31
   isis enable leaf2
   isis network point-to-point
!
interface Ethernet2
   description spine2
   no switchport
   ip address 10.2.2.3/31
   isis enable leaf2
   isis network point-to-point
!
interface Ethernet3
   isis network point-to-point
!
interface Loopback1
   ip address 10.1.1.2/32
   isis enable leaf2
   isis passive
!
interface Management1
!
ip routing
!
ip prefix-list connected
   seq 10 permit 10.0.0.0/14
   seq 20 deny 0.0.0.0/0
!
route-map connected permit 10
   match ip address prefix-list connected
!
route-map connected deny 20
   match ip address prefix-list connected
!
router isis leaf2
   net 49.0001.0100.0100.1002.00
   is-hostname leaf2
   is-type level-2
   log-adjacency-changes
   redistribute connected route-map connected
   !
   address-family ipv4 unicast
!
end
leaf2#
  ```
</details>

<details>
  <summary>leaf3 configuration</summary>

  ```cisco
leaf3#sh run
! Command: show running-config
! device: leaf3 (vEOS-lab, EOS-4.27.0F)
!
! boot system flash:/vEOS-lab.swi
!
no aaa root
!
transceiver qsfp default-mode 4x10G
!
service routing protocols model ribd
!
hostname leaf3
!
spanning-tree mode mstp
!
interface Ethernet1
   description spine1
   no switchport
   ip address 10.2.1.5/31
   isis enable leaf3
   isis network point-to-point
!
interface Ethernet2
   description spine2
   no switchport
   ip address 10.2.2.5/31
   isis enable leaf3
   isis network point-to-point
!
interface Ethernet3
   isis network point-to-point
!
interface Ethernet4
!
interface Loopback1
   ip address 10.1.1.3/32
   isis enable leaf3
   isis passive
!
interface Management1
!
ip routing
!
ip prefix-list connected
   seq 10 permit 10.0.0.0/14
   seq 20 deny 0.0.0.0/0
!
route-map connected permit 10
   match ip address prefix-list connected
!
route-map connected deny 20
   match ip address prefix-list connected
!
router isis leaf3
   net 49.0001.0100.0100.1003.00
   is-hostname leaf3
   is-type level-2
   log-adjacency-changes
   redistribute connected route-map connected
   !
   address-family ipv4 unicast
!
end
leaf3#
  ```
</details>

## 5. Проверка сетевой связности.
<details>
  <summary>проверка соседства</summary>

  ```cisco
spine1#sh isis neighbors

Instance  VRF      System Id        Type Interface          SNPA              State Hold time   Circuit Id
spine1    default  leaf1            L2   Ethernet1          P2P               UP    22          06
spine1    default  leaf2            L2   Ethernet2          P2P               UP    25          06
spine1    default  leaf3            L2   Ethernet3          P2P               UP    26          07
  ```
  
  ```cisco
spine2#sh isis neighbors

Instance  VRF      System Id        Type Interface          SNPA              State Hold time   Circuit Id
spine2    default  leaf1            L2   Ethernet1          P2P               UP    23          07
spine2    default  leaf2            L2   Ethernet2          P2P               UP    29          07
spine2    default  leaf3            L2   Ethernet3          P2P               UP    22          08
  ```
  
  ```cisco
leaf1#sh isis neighbors

Instance  VRF      System Id        Type Interface          SNPA              State Hold time   Circuit Id
leaf1     default  spine1           L2   Ethernet1          P2P               UP    26          06
leaf1     default  spine2           L2   Ethernet2          P2P               UP    29          06
  ```
</details>

<details>
  <summary>динамические маршруты</summary>

  ```cisco
spine1#sh ip route

VRF: default
Codes: C - connected, S - static, K - kernel,
       O - OSPF, IA - OSPF inter area, E1 - OSPF external type 1,
       E2 - OSPF external type 2, N1 - OSPF NSSA external type 1,
       N2 - OSPF NSSA external type2, B - BGP, B I - iBGP, B E - eBGP,
       R - RIP, I L1 - IS-IS level 1, I L2 - IS-IS level 2,
       O3 - OSPFv3, A B - BGP Aggregate, A O - OSPF Summary,
       NG - Nexthop Group Static Route, V - VXLAN Control Service,
       DH - DHCP client installed default route, M - Martian,
       DP - Dynamic Policy Route, L - VRF Leaked,
       G  - gRIBI, RC - Route Cache Route

Gateway of last resort is not set

 C        10.0.1.1/32 is directly connected, Loopback1
 I L2     10.0.1.2/32 [115/30] via 10.2.1.1, Ethernet1
                               via 10.2.1.3, Ethernet2
                               via 10.2.1.5, Ethernet3
 I L2     10.1.1.1/32 [115/20] via 10.2.1.1, Ethernet1
 I L2     10.1.1.2/32 [115/20] via 10.2.1.3, Ethernet2
 I L2     10.1.1.3/32 [115/20] via 10.2.1.5, Ethernet3
 C        10.2.1.0/31 is directly connected, Ethernet1
 C        10.2.1.2/31 is directly connected, Ethernet2
 C        10.2.1.4/31 is directly connected, Ethernet3
 I L2     10.2.2.0/31 [115/20] via 10.2.1.1, Ethernet1
 I L2     10.2.2.2/31 [115/20] via 10.2.1.3, Ethernet2
 I L2     10.2.2.4/31 [115/20] via 10.2.1.5, Ethernet3
spine1#
  ```

  ``` cisco
spine2#sh ip route

VRF: default
Codes: C - connected, S - static, K - kernel,
       O - OSPF, IA - OSPF inter area, E1 - OSPF external type 1,
       E2 - OSPF external type 2, N1 - OSPF NSSA external type 1,
       N2 - OSPF NSSA external type2, B - BGP, B I - iBGP, B E - eBGP,
       R - RIP, I L1 - IS-IS level 1, I L2 - IS-IS level 2,
       O3 - OSPFv3, A B - BGP Aggregate, A O - OSPF Summary,
       NG - Nexthop Group Static Route, V - VXLAN Control Service,
       DH - DHCP client installed default route, M - Martian,
       DP - Dynamic Policy Route, L - VRF Leaked,
       G  - gRIBI, RC - Route Cache Route

Gateway of last resort is not set

 I L2     10.0.1.1/32 [115/30] via 10.2.2.1, Ethernet1
                               via 10.2.2.3, Ethernet2
                               via 10.2.2.5, Ethernet3
 C        10.0.1.2/32 is directly connected, Loopback1
 I L2     10.1.1.1/32 [115/20] via 10.2.2.1, Ethernet1
 I L2     10.1.1.2/32 [115/20] via 10.2.2.3, Ethernet2
 I L2     10.1.1.3/32 [115/20] via 10.2.2.5, Ethernet3
 I L2     10.2.1.0/31 [115/20] via 10.2.2.1, Ethernet1
 I L2     10.2.1.2/31 [115/20] via 10.2.2.3, Ethernet2
 I L2     10.2.1.4/31 [115/20] via 10.2.2.5, Ethernet3
 C        10.2.2.0/31 is directly connected, Ethernet1
 C        10.2.2.2/31 is directly connected, Ethernet2
 C        10.2.2.4/31 is directly connected, Ethernet3
spine2#
  ```

  ``` cisco
leaf1#sh ip route

VRF: default
Codes: C - connected, S - static, K - kernel,
       O - OSPF, IA - OSPF inter area, E1 - OSPF external type 1,
       E2 - OSPF external type 2, N1 - OSPF NSSA external type 1,
       N2 - OSPF NSSA external type2, B - BGP, B I - iBGP, B E - eBGP,
       R - RIP, I L1 - IS-IS level 1, I L2 - IS-IS level 2,
       O3 - OSPFv3, A B - BGP Aggregate, A O - OSPF Summary,
       NG - Nexthop Group Static Route, V - VXLAN Control Service,
       DH - DHCP client installed default route, M - Martian,
       DP - Dynamic Policy Route, L - VRF Leaked,
       G  - gRIBI, RC - Route Cache Route

Gateway of last resort is not set

 I L2     10.0.1.1/32 [115/20] via 10.2.1.0, Ethernet1
 I L2     10.0.1.2/32 [115/20] via 10.2.2.0, Ethernet2
 C        10.1.1.1/32 is directly connected, Loopback1
 I L2     10.1.1.2/32 [115/30] via 10.2.1.0, Ethernet1
                               via 10.2.2.0, Ethernet2
 I L2     10.1.1.3/32 [115/30] via 10.2.1.0, Ethernet1
                               via 10.2.2.0, Ethernet2
 C        10.2.1.0/31 is directly connected, Ethernet1
 I L2     10.2.1.2/31 [115/20] via 10.2.1.0, Ethernet1
 I L2     10.2.1.4/31 [115/20] via 10.2.1.0, Ethernet1
 C        10.2.2.0/31 is directly connected, Ethernet2
 I L2     10.2.2.2/31 [115/20] via 10.2.2.0, Ethernet2
 I L2     10.2.2.4/31 [115/20] via 10.2.2.0, Ethernet2

leaf1#
  ```
</details>

<details>
  <summary>проверка консистентности LSDB</summary>

  ```cisco
spine1#sh isis database

IS-IS Instance: spine1 VRF: default
  IS-IS Level 2 Link State Database
    LSPID                 Seq Num   Cksum  Life  IS Flags
    spine1.00-00          81        62487  874   L2 <>
    spine2.00-00          87        65275  943   L2 <>
    leaf1.00-00           86        3841   810   L2 <>
    leaf2.00-00           78        20921  836   L2 <>
    leaf3.00-00           81        29320  863   L2 <>
  ```

  ```cisco
spine2#sh isis database

IS-IS Instance: spine2 VRF: default
  IS-IS Level 2 Link State Database
    LSPID                 Seq Num   Cksum  Life  IS Flags
    spine1.00-00          81        62487  859   L2 <>
    spine2.00-00          87        65275  928   L2 <>
    leaf1.00-00           86        3841   796   L2 <>
    leaf2.00-00           78        20921  821   L2 <>
    leaf3.00-00           81        29320  848   L2 <>
  ```

  ```cisco
leaf1#sh isis database

IS-IS Instance: leaf1 VRF: default
  IS-IS Level 2 Link State Database
    LSPID                 Seq Num   Cksum  Life  IS Flags
    spine1.00-00          81        62487  844   L2 <>
    spine2.00-00          87        65275  913   L2 <>
    leaf1.00-00           86        3841   780   L2 <>
    leaf2.00-00           78        20921  806   L2 <>
    leaf3.00-00           81        29320  833   L2 <>
  ```
  
  ```cisco
leaf2#sh isis database

IS-IS Instance: leaf2 VRF: default
  IS-IS Level 2 Link State Database
    LSPID                 Seq Num   Cksum  Life  IS Flags
    spine1.00-00          81        62487  830   L2 <>
    spine2.00-00          87        65275  899   L2 <>
    leaf1.00-00           86        3841   791   L2 <>
    leaf2.00-00           78        20921  793   L2 <>
    leaf3.00-00           81        29320  819   L2 <>
  ```

  ``` cisco
leaf3#sh isis database

IS-IS Instance: leaf3 VRF: default
  IS-IS Level 2 Link State Database
    LSPID                 Seq Num   Cksum  Life  IS Flags
    spine1.00-00          81        62487  805   L2 <>
    spine2.00-00          87        65275  874   L2 <>
    leaf1.00-00           86        3841   789   L2 <>
    leaf2.00-00           78        20921  789   L2 <>
    leaf3.00-00           82        28809  1193  L2 <>
```
</details>

<details>
  <summary>трассировка между лифами</summary>

  ```cisco
leaf3#traceroute 10.1.1.1
traceroute to 10.1.1.1 (10.1.1.1), 30 hops max, 60 byte packets
 1  10.2.1.4 (10.2.1.4)  1.917 ms  1.993 ms  2.209 ms
 2  10.1.1.1 (10.1.1.1)  6.111 ms  6.433 ms  8.926 ms
  ```
</details>
  
[Назад, к списку домашних заданий](../README.md)
